_posts/2021-11-12-fosdem-2021-network-devroom-cfp.md
---
layout: default
title: FOSDEM 2022 Network Devroom CFP
date: 2021-11-12 00:00:00 +0000
---

We are excited to announce that the call for proposals is now open for the  
Network devroom at [FOSDEM 2022](https://fosdem.org/2022/). FOSDEM is a free event for engineers to meet,  
share ideas and collaborate. FOSDEM is one of the largest events of its kind,  
hosting, thousands of developers of free and open source software from all over  
the world.  

Please note that, due to Covid-19, FOSDEM will be held virtually again next year  
on the 5th and 6th of February, 2022. All presentations will be pre-recorded  
with live chat during each presentation and live Q&A after each presentation.  


# Important Dates

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Sunday 12th December</td>
<td class="org-left">Submission deadline</td>
</tr>


<tr>
<td class="org-left">Friday 24th December</td>
<td class="org-left">Announcement of selected talks</td>
</tr>


<tr>
<td class="org-left">Friday 28th January</td>
<td class="org-left">Recorded Presentation and slide upload deadline</td>
</tr>


<tr>
<td class="org-left">5 &amp; 6th February</td>
<td class="org-left">Conference dates (online)</td>
</tr>


<tr>
<td class="org-left">5th February</td>
<td class="org-left">Network devroom date (online)</td>
</tr>
</tbody>
</table>


# About the devroom

The FOSDEM Network devroom hosts a diversity of talks covering open source  
networking projects and technologies. The scope of the Network devroom is broad  
and targets those software developers engaged in network design, monitoring,  
management and software development with open source tools.  

We typically host a variety of talks on Networking topics including:  

-   Network monitoring (inventory, discovery & telemetry),
-   Network management (enterprise, carrier-grade, cloud, IoT)
-   Networking protocols (the full alphabet soup)
-   Security (IPS, IDS, protocols)
-   Authentication
-   Development tools (libraries, SDKs, plugins)
-   Network stacks


# Suggested Topics:

If it moves network packets, monitors, or interacts with, or supervises entities  
that moves network packets, it is likely a topic the devroom is interested in. A  
very *non-exhaustive* list of the projects and topics we would love to see on  
the schedule are:  

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Monitoring</td>
<td class="org-left">Nagios, Icinga2, Naemon, NTop, SNAS, Graphana, Prometheus, collectd</td>
</tr>


<tr>
<td class="org-left">Frameworks</td>
<td class="org-left">DPDK, eBPF, XDP, FD.io, PANDA</td>
</tr>


<tr>
<td class="org-left">Switching</td>
<td class="org-left">Snabb, OpenvSwitch, Tungsten Fabric, Lagopus, FastClick</td>
</tr>


<tr>
<td class="org-left">Stacks</td>
<td class="org-left">Linux, *BSD, F-Stack</td>
</tr>


<tr>
<td class="org-left">Controllers</td>
<td class="org-left">Istio, Envoy, Network Service Mesh, OpenDayLight, Calico, Contiv</td>
</tr>


<tr>
<td class="org-left">Edge</td>
<td class="org-left">Akraino, Openness</td>
</tr>


<tr>
<td class="org-left">Routing</td>
<td class="org-left">FRRouting, BIRD, Go-BGP</td>
</tr>


<tr>
<td class="org-left">Management</td>
<td class="org-left">ONAP, Ganglia, NetSNMP, PNDA.io</td>
</tr>


<tr>
<td class="org-left">Security</td>
<td class="org-left">Suricata, Snort</td>
</tr>


<tr>
<td class="org-left">Tooling</td>
<td class="org-left">VSPerf, TRex, Moongen, Scapy, Warp17</td>
</tr>
</tbody>
</table>

Talks should be aimed at a technical audience, but should not assume that  
attendees are already familiar with your project or how it solves a given  
problem. Talk proposals may cover very specific solutions to a problem, or may  
be a higher level project overview for lesser known projects.  


# Code of Conduct

[FOSDEM Code of Conduct](https://fosdem.org/2022/practical/conduct/):  

We'd like to remind all speakers and attendees that all of the presentations and  
discussions in our devroom are held under the guidelines set in the CoC and we  
expect attendees, speakers, and volunteers to follow the CoC at all times.  

If you submit a proposal and it is accepted, you will be required to confirm  
that you accept the FOSDEM CoC. If you have any questions about the CoC or wish  
to have one of the devroom organizers review your presentation slides or any  
other content for CoC compliance, please email us and we will do our best to  
assist you.  


# Proposals:

Proposals should be made through the [FOSDEM Pentabarf submission tool](https://penta.fosdem.org/submission/FOSDEM22). You do  
not need to create a new Pentabarf account if you already have one from a past  
year.  

Please select the "Network" as the **track** and ensure you include the following  
information when submitting a proposal:  

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Section</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Person</td>
<td class="org-left">Name(s)</td>
<td class="org-left">Your first, last and public names.</td>
</tr>


<tr>
<td class="org-left">Person</td>
<td class="org-left">Abstract</td>
<td class="org-left">A short bio.</td>
</tr>


<tr>
<td class="org-left">Person</td>
<td class="org-left">Photo</td>
<td class="org-left">Please provide a photo.</td>
</tr>


<tr>
<td class="org-left">Event</td>
<td class="org-left">Event Title</td>
<td class="org-left"><b>This is the title of your talk</b> - please be descriptive to encourage attendance.</td>
</tr>


<tr>
<td class="org-left">Event</td>
<td class="org-left">Abstract</td>
<td class="org-left">Short abstract of one or two paragraphs.</td>
</tr>


<tr>
<td class="org-left">Event</td>
<td class="org-left">Duration</td>
<td class="org-left">Please indicate the length of your talk; 15 min, 30 min or 45 min</td>
</tr>
</tbody>
</table>

If your talk is accepted, the deadline to upload your slides and a pre-recorded  
version of your talk is Friday 28th January. FOSDEM will be held on the weekend  
of February 5th & 6th, 2022 and the Network devroom will take place on the 5th  
February.  

Please also join the devroom’s mailing list, which is the official communication  
channel for the devroom:  

[network-devroom@lists.fosdem.org](https://lists.fosdem.org/listinfo/network-devroom) (subscription page)   


# Team:

Ray Kinsella  
Stephan Schmidt  
Thomas Monjalon  
Emma Foley  
Alexander Biehl  
Charles Eckel  

